#+TITLE: Exploring a new data set
#+AUTHOR: Marcus Birkenkrahe
#+Subtitle: Introduction to Data Visualization
#+STARTUP: hideblocks overview indent inlineimages
#+PROPERTY: header-args:R :exports both :results output :session *R*
* Running ~BasicSummary~ on different datasets  

- Run ~BasicSummary~ on the imported data set ~df~
  #+begin_src R
    df <- read.csv(file="https://tinyurl.com/spdnvxbr",
                   header=TRUE,
                   stringsAsFactors=TRUE)
    BasicSummary(df)
  #+end_src

  #+RESULTS:
  :   variable    type levels topLevel topCount topFrac missFreq missFrac
  : 1   Weight integer      9       75        2     0.2        0        0
  : 2   Height integer      9      178        2     0.2        0        0
  : 3      Sex  factor      2     male        6     0.6        0        0
  : 4     Name  factor     10     Carl        1     0.1        0        0

- Run ~BasicSummary~ on a real data set from the web,
  ~HollywoodMovies2011~ from the ~Lock5withR~ packagex:
  #+begin_src R
    library(Lock5withR)  # you may have to install this package
    data(HollywoodMovies2011)
    options(width=100)
    hw <- BasicSummary(HollywoodMovies2011)
    head(hw)
  #+end_src

  #+RESULTS:
  :         variable    type levels           topLevel topCount topFrac missFreq missFrac
  : 1          Movie  factor    136 30 Minutes or Less        1   0.007        0    0.000
  : 2     LeadStudio  factor     34        Independent       32   0.235        0    0.000
  : 3 RottenTomatoes integer     76                 38        5   0.037        2    0.015
  : 4  AudienceScore integer     61                 50        7   0.051        1    0.007
  : 5          Story  factor     22      Monster Force       19   0.140        1    0.007
  : 6          Genre  factor      9             Action       32   0.235        0    0.000

- Run ~BasicSummary~ on the ~Chile~ data frame from the ~car~ package
  #+begin_src R
    library(car)
    data(Chile)
    BasicSummary(Chile,dgts=3)
  #+end_src

  #+RESULTS:
  :     variable    type levels topLevel topCount topFrac missFreq missFrac
  : 1     region  factor      5       SA      960   0.356        0    0.000
  : 2 population integer     10   250000     1300   0.481        0    0.000
  : 3        sex  factor      2        F     1379   0.511        0    0.000
  : 4        age integer     54       21       96   0.036        1    0.000
  : 5  education  factor      4        S     1120   0.415       11    0.004
  : 6     income integer      8    15000      768   0.284       98    0.036
  : 7  statusquo numeric   2093 -1.29617      201   0.074       17    0.006
  : 8       vote  factor      5        N      889   0.329      168    0.062

- A closer look at the last result:
  1) Most of the variables have good explanatory names (except ~statusquo~)
  2) R distinguishes ~integer~ and ~numeric~ (decimal) numbers
  3) Missing values are counted as a single level: e.g. ~income~ has ~8~
     levels but the ~table~ only lists 7 because of the ~NA~. 
     
     #+begin_src R
       table(Chile$income)  # useNA="no" or "ifany"
     #+end_src

     #+RESULTS:
     : 
     :   2500   7500  15000  35000  75000 125000 200000 
     :    160    494    768    747    269     88     76
  4) Missing values may have to be removed - if they show up depends
     on the precision of the record: add ~dgts=5~ in the function call.
